# ---------------- СПИСОК УРОКОВ ----------------
lessons = {
    "Python": [
        "Урок 1: Введение в Python",
        "Урок 2: Переменные и типы данных",
        "Урок 3: Условные операторы",
        "Урок 4: Циклы for и while",
        "Урок 5: Функции",
    ],

    "C++": [
        "Урок 1: Введение в C++",
        "Урок 2: Переменные и типы данных",
        "Урок 3: Условные операторы",
        "Урок 4: Циклы for, while и do while",
        "Урок 5: Функции",
    ],

    "Java": [
        "Урок 1: Введение в Java",
        "Урок 2: Переменные и типы данных",
        "Урок 3: Условные операторы",
        "Урок 4: Циклы for и while",
        "Урок 5: Классы и объекты",
    ],

    "JavaScript": [
        "Урок 1: Введение в JavaScript",
        "Урок 2: Переменные и типы данных",
        "Урок 3: Условные операторы",
        "Урок 4: Циклы for и while",
        "Урок 5: Классы и объекты",
    ],

    "C#": [
        "Урок 1: Введение в C#",
        "Урок 2: Переменные и типы данных",
        "Урок 3: Условные операторы",
        "Урок 4: Циклы for и while",
        "Урок 5: Классы и объекты",
    ],
}

